## 파이썬 기초다루기
### 판다스 
#### 0629 memo

-----

### 판다스의 정의
 > 엑셀과 상당히 유사한 자료형으로 행렬과 같은 2차원 자료이다. 
 >
 > 데이터 수정/가공 및 분석이 용이하다. 
 >
 > 데이터 가공을 위한 수많은 함수를 지원한다. 
 >
 > Numpy 기반으로 수학적 분석 또한 가능

`-` 데이터프레임 ($\star\star\star$)

 > 2차원 배열 (행렬)
 >
 > 왼 (행 인덱스) / 오 (열 이름 혹은 라벨)
 >
 > 열은 시리즈 객체 (즉, 딕셔너리(리스트) 주제 ex)주소, 가격, 성별 등)
 
 > 같은 길이(원소 개수)의 배열 여러 개 필요 (대부분 딕셔너리나 리스트 사용함) / 혹은 딕셔너리 안 리스트
 >
 > index는 행 인덱스들의 배열/ columns는 열 인덱스의 배열

In [1]:
import pandas as pd

In [2]:
# 딕셔너리로만 데이터프레임 만들기 
dict_data =  {'c0':[1,2,3], 'c1':[4,5,6], 'c2':[7,8,9],'c':[10,11,12], 'c4':[13,14,15]} # key가 열이름(라벨)

df = pd.DataFrame(dict_data)
print(df)

   c0  c1  c2   c  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [3]:
# 리스트로 데이터프레임 만들기 
df = pd.DataFrame([[15,'남','덕영중'], [17,'여','수리중']], 
                 index = ['준서','예은'], #행
                 columns=['나이','성별','학교']) #열
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [4]:
df.rename(columns={'나이':'연령'}) #열 이름 바꾸기 / inplace = T 는 대체되어 저장
df.rename(index={'준서':'차헌'}) # 행 이름 (행을 생각하면 index부터 생각하기)

    나이 성별   학교
차헌  15  남  덕영중
예은  17  여  수리중

`*` 모르는 패키지(모듈)은 Help 들어가서 직접 찾아보고 공부하기

In [13]:
df.drop('나이',axis = 1) # axis는 행 = 0 열 = 1
df.drop(['성별','학교'], axis = 1) # 2개 이상은 []쳐야함

    나이
준서  15
예은  17

`-` 데이터 프레임 인덱싱 ($\star\star\star$)
 >2차원 자료니 더 헷갈리 수 밖에 없음!
 >
 >`TiP` []는 위치값, ()클래스 안에 함수를 사용할 때 이용. 

 >loc = 인덱스 이름 기준 /
 iloc = 정수형 위치 인덱스

In [16]:
df

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

In [33]:
# 행 선택 

print(df.loc['준서'],'\n') # 행이름으로 추출
print(df.loc[['준서','예은']], '\n') # 2개 이상 r각각 추출은 []로 묶어야함 
print(df.loc['준서':'예은'], '\n') # 범위 지정
print('------', '\n')
print(df.iloc[1],'\n') #행 순서로 추출
print(df.iloc[[0,1]], '\n') # 개별, 각각 2개 이상이니 [[]]
print(df.iloc[1:2], '\n')

나이     15
성별      남
학교    덕영중
Name: 준서, dtype: object

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

------

나이     17
성별      여
학교    수리중
Name: 예은, dtype: object

    나이 성별   학교
준서  15  남  덕영중
예은  17  여  수리중

    나이 성별   학교
예은  17  여  수리중

In [43]:
# 열 선택 

df['나이'] # 데이터 프레임은 열 이름 인덱싱을 해야한다. 문자열처럼 정수 인덱싱 X 
df.나이

df[['나이','성별']] # 2개 이상 개별 인덱싱

    나이 성별
준서  15  남
예은  17  여

In [59]:
# 원소 1개 선택 

df.loc['준서','나이'] # x,y  x는 행 y는 열 / 이래서 행 or 열 두개 이상 구하려면 [[]] 사용한거임.
df.iloc[0,2] # 똑같은데 숫자좌표

# 원소 2개 선택 

df.loc['준서',['나이','성별']]
df.iloc[0,1:2] #누차 얘기하지만 []한번 더 쓰는건 각각 추출인거고 범위는 :면 됨

# 데이터 프레임 선택 

df.loc[['준서','예은'],['나이','성별']] 
df.iloc[0:1,[1,2]] #범위 + 개별선택 모두 가능
df.loc[1:300,'mpg'] # 추출 시 이름이 들어간다면 꼭 loc

   성별   학교
준서  남  덕영중

`-` 데이터프레임 조건 추출 (필터링)

In [37]:
df[df.mpg>40] # 열 필터링 시 열 이름만 쓰는게 아니라 DF.Columns + 조건 이라 써야함 
df.query('mpg>40') # query 함수를 쓸 때는 또 ,, 열 이름 + 조건이다. 

df[(df.mpg>40) & (df.weight>2300)] # 복수 조건은 조건에 () 쓰면 된다. 
# df.iloc[1:300, (df.mpg>40)] 혹시 300번 까지의 행에서 특정 조건열을 열고 싶다면?

,mpg,cylinders,displacement,horsepewer,weight,acceleration,model year,origin,name
326,43.4,4,90.0,48.00,2335.0,23.7,80,2,vw dasher (diesel)

In [38]:
df.filter(like='m', axis=1) # 열 이름에 m이 있나? 알아만둬

      mpg  displacement  model year                       name
0    18.0         307.0          70  chevrolet chevelle malibu
1    15.0         350.0          70          buick skylark 320
2    18.0         318.0          70         plymouth satellite
3    16.0         304.0          70              amc rebel sst
4    17.0         302.0          70                ford torino
..    ...           ...         ...                        ...
393  27.0         140.0          82            ford mustang gl
394  44.0          97.0          82                  vw pickup
395  32.0         135.0          82              dodge rampage
396  28.0         120.0          82                ford ranger
397  31.0         119.0          82                 chevy s-10

[398 rows x 4 columns]

In [71]:
# 열추가 

# df['진로'] = ['선생님','개발자'] # 이건 열 생성도 가능하지만 덮어쓰기도 가능함 (즉 변경도 가능함)
df['용돈'] = 50 # 일괄적으로 넣을 수도 있음 

# 행추가 

df.loc['차헌'] = [26,'남','전북대','분석가',50]

    나이 성별   학교   진로  용돈
준서  15  남  덕영중  선생님  50
예은  17  여  수리중  개발자  50
차헌  26  남  전북대  분석가  50

`깨달음` 아하! 행,열 추가는 행,열을 선택하는 코드에 = 입력값을 넣으면 되는구나!

In [73]:
#원소값 변경 (도 마찬가지!)

df.loc['차헌','용돈'] = 70

# 행/열 위치 바꾸기

df.T

     준서   예은   차헌
나이   15   17   26
성별    남    여    남
학교  덕영중  수리중  전북대
진로  선생님  개발자  분석가
용돈   50   50   70

In [1]:
# 특정 열을 행 인덱스로 설정하기 

exam_data = {'이름' : [ '서준', '우현', '인아'],
'수학' : [ 90, 80, 70],
'영어' : [ 98, 89, 95],
'음악' : [ 85, 95, 100],
'체육' : [ 100, 90, 90]}

df = pd.DataFrame(exam_data)
print(df, '\n') #이렇게 행 이름이 단순히 인덱스 인 경우 이름을 행이름으로 바꾸고 싶다. 

ndf = df.set_index(['이름']) #이렇게 하면 됨!

# df.index = 행 이름 리스트 (바로 행 이름들 바뀜)

NameError: name 'pd' is not defined

In [90]:
exam_data = {'수학' : [90, 80, 70],
            '영어' : [98,89,95],
            '음악' : [85, 95,100],
            '체육' : [100,90,90]}

df = pd.DataFrame(exam_data, index=['서준','우현','인아']) # 데이터프레임 생성 및 행이름 생성

df['총점'] = df['수학'] +df['영어'] +df['음악'] +df['체육'] # 열끼리 계산하고 바로 열 생성 할 수 있음
df['평균'] = df['총점']/4

print(df)

    수학  영어   음악   체육   총점     평균
서준  90  98   85  100  373  93.25
우현  80  89   95   90  354  88.50
인아  70  95  100   90  355  88.75

In [92]:
grades = []

for i in df['평균']: # 반복문 안에 DF 열을 넣을 수 있음 
    if i >= 90:
        grades.append('A')
    elif i >= 80:
        grades.append('B')
    else:
        grades.append('C')
        
df['성적'] = grades
df

    수학  영어   음악   체육   총점     평균 성적
서준  90  98   85  100  373  93.25  A
우현  80  89   95   90  354  88.50  B
인아  70  95  100   90  355  88.75  B

* 함수를 데이터프레임 안에 사용해보자.

In [94]:
def scholarship(row):
    print(row)
    if row == 'A':
        return '장학생'
    else:
        return '비장학생'

In [95]:
df['장학여부'] = df.성적.apply(scholarship) # apply  각각에 함수 대입

A
B
B

> `함수 설명` 
>
>map() / 1차원 객체를 변환할때 각 요소에 함수를 적용 할 수 있다. 
>
>> " for i in map(함수, 변수): "
>
>apply() / 2차원 객체(자료형)의 행/열에 만들어 놓은 함수를 대입해주는 함수 / axis = 0 or 1

+ 데이터프레임은 서로 연산이 가능하며 Nun값이 있다면 출력도 NUn으로 된다.

-----------

### 파일 불러오기

`-` 고정 폴더 만들기

In [108]:
import os

In [111]:
os.chdir('C:/Users/Oldcar/Documents/새 폴더') # 이런식으로 경로를 고정 할 수 있다.
                                              # 하지만 주피터 랩은 자동으로 노트 경로가 고정되니 알아만두기.

`-`csv, json, xsls 등 파일 불러오기

- 파일 경로 
  - pd.read_csv()
  - pd.read_excel()
  - pd.read_json()
  
- 웹 페이지에서 표 가져오기
  - pd.read_html('웹주소' or ' HTML 파일 경로') 
   -dfdf

> `제이슨 파일` 
>
> 자바 스크립트에서 유래한 데이터 공유를 목적으로 개발된 특수 파일
>
> 파이썬 딕셔너리와 비슷한 구조

In [7]:
df = pd.read_csv('data/auto-mpg.csv', header = None)
df.columns = ['mpg', 'cylinders','displacement','horsepewer','weight', 'acceleration','model year','origin','name']

df.head()

,mpg,cylinders,displacement,horsepewer,weight,acceleration,model year,origin,name
0,18.0,8,307.0,130.0,3504.0,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693.0,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150.0,3436.0,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150.0,3433.0,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140.0,3449.0,10.5,70,1,ford torino

`-` 데이터프레임 구조

In [9]:
df.info() #df의 내용 확인 / 정수형이야 하는데 object이다?

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepewer    398 non-null    object
 4   weight        398 non-null    float64
 5   acceleration  398 non-null    float64
 6   model year    398 non-null    int64
 7   origin        398 non-null    int64
 8   name          398 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 28.1+ KB

In [14]:
df.describe() # df의 기술통계 정보 확인 
df.describe(include = 'all') # 칼럼이 너무 많으면 생략 될 수도 있음 그럴때 억지로라도 다 나오게 하는것

,mpg,cylinders,displacement,horsepewer,weight,acceleration,model year,origin,name
count,398.000000,398.000000,398.000000,398,398.000000,398.000000,398.000000,398.000000,398
unique,NaN,NaN,NaN,94,NaN,NaN,NaN,NaN,305
top,NaN,NaN,NaN,150.0,NaN,NaN,NaN,NaN,ford pinto
freq,NaN,NaN,NaN,22,NaN,NaN,NaN,NaN,6
mean,23.514573,5.454774,193.425879,NaN,2970.424623,15.568090,76.010050,1.572864,NaN
std,7.815984,1.701004,104.269838,NaN,846.841774,2.757689,3.697627,0.802055,NaN
min,9.000000,3.000000,68.000000,NaN,1613.000000,8.000000,70.000000,1.000000,NaN
25%,17.500000,4.000000,104.250000,NaN,2223.750000,13.825000,73.000000,1.000000,NaN
50%,23.000000,4.000000,148.500000,NaN,2803.500000,15.500000,76.000000,1.000000,NaN
75%,29.000000,8.000000,262.000000,NaN,3608.000000,17.175000,79.000000,2.000000,NaN
max,46.600000,8.000000,455.000000,NaN,5140.000000,24.800000,82.000000,3.000000,NaN

In [16]:
print(df.count()) # df 각 열의 개수 확인
print(df.origin.value_counts()) # df의 특정열의 고유값을 확인

mpg             398
cylinders       398
displacement    398
horsepewer      398
weight          398
acceleration    398
model year      398
origin          398
name            398
dtype: int64
1    249
3     79
2     70
Name: origin, dtype: int64

In [18]:
df[['model year', 'weight']].mean()

model year      76.010050
weight        2970.424623
dtype: float64

`-` 데이터 그룹화 하기!

In [48]:
df_groupby = df.groupby(by = ['origin']) # by = 열이름 / 해당 열의 고유값들 끼리 묶는 작업

In [50]:
df_groupby.groups # 그렇게 모은 것들을 그룹별로 출력하는것 

for origin, group in df_groupby: #그룹별로 출력한 것 형태가 흡사 딕셔너리였다. 키와 값(행인덱스)
    print(origin, 'origin :' , len(group)) # 이걸 나누어서 출력을 하는데 신기하게도 분리된 값은 따로 출력하면 전체 df가 나온다. 
    print(group)
    print('\n')

1 origin : 249
      mpg  cylinders  displacement horsepewer  weight  acceleration  \
0    18.0          8         307.0      130.0  3504.0          12.0
1    15.0          8         350.0      165.0  3693.0          11.5
2    18.0          8         318.0      150.0  3436.0          11.0
3    16.0          8         304.0      150.0  3433.0          12.0
4    17.0          8         302.0      140.0  3449.0          10.5
..    ...        ...           ...        ...     ...           ...
392  27.0          4         151.0      90.00  2950.0          17.3
393  27.0          4         140.0      86.00  2790.0          15.6
395  32.0          4         135.0      84.00  2295.0          11.6
396  28.0          4         120.0      79.00  2625.0          18.6
397  31.0          4         119.0      82.00  2720.0          19.4

     model year  origin                       name
0            70       1  chevrolet chevelle malibu
1            70       1          buick skylark 320
2            70       1         plymouth satellite
3            70       1              amc rebel sst
4            70       1                ford torino
..          ...     ...                        ...
392          82       1           chevrolet camaro
393          82       1            ford mustang gl
395          82       1              dodge rampage
396          82       1                ford ranger
397          82       1                 chevy s-10

[249 rows x 9 columns]


2 origin : 70
      mpg  cylinders  displacement horsepewer  weight  acceleration  \
19   26.0          4          97.0      46.00  1835.0          20.5
20   25.0          4         110.0      87.00  2672.0          17.5
21   24.0          4         107.0      90.00  2430.0          14.5
22   25.0          4         104.0      95.00  2375.0          17.5
23   26.0          4         121.0      113.0  2234.0          12.5
..    ...        ...           ...        ...     ...           ...
354  34.5          4         100.0          ?  2320.0          15.8
359  28.1          4         141.0      80.00  3230.0          20.4
360  30.7          6         145.0      76.00  3160.0          19.6
375  36.0          4         105.0      74.00  1980.0          15.3
394  44.0          4          97.0      52.00  2130.0          24.6

     model year  origin                          name
19           70       2  volkswagen 1131 deluxe sedan
20           70       2                   peugeot 504
21           70       2                   audi 100 ls
22           70       2                      saab 99e
23           70       2                      bmw 2002
..          ...     ...                           ...
354          81       2                   renault 18i
359          81       2     peugeot 505s turbo diesel
360          81       2                  volvo diesel
375          82       2           volkswagen rabbit l
394          82       2                     vw pickup

[70 rows x 9 columns]


3 origin : 79
      mpg  cylinders  displacement horsepewer  weight  acceleration  \
14   24.0          4         113.0      95.00  2372.0          15.0
18   27.0          4          97.0      88.00  2130.0          14.5
29   27.0          4          97.0      88.00  2130.0          14.5
31   25.0          4         113.0      95.00  2228.0          14.0
53   31.0          4          71.0      65.00  1773.0          19.0
..    ...        ...           ...        ...     ...           ...
382  34.0          4         108.0      70.00  2245.0          16.9
383  38.0          4          91.0      67.00  1965.0          15.0
384  32.0          4          91.0      67.00  1965.0          15.7
385  38.0          4          91.0      67.00  1995.0          16.2
390  32.0          4         144.0      96.00  2665.0          13.9

     model year  origin                   name
14           70       3  toyota corona mark ii
18           70       3           datsun pl510
29           71       3           datsun pl510
31           71       3          toyota corona
53           71       3    toyota corolla 1200
..          ...     ...                    ...
382          82       3         toyota corolla
383          82       3            honda civic
384          82       3     honda civic (auto)
385          82       3          datsun 310 gx
390          82       3       toyota celica gt

[79 rows x 9 columns]

In [51]:
df.groupby(by=['origin']).count() #그룹별로 모아서 고유값의 개수 알기

,mpg,cylinders,displacement,horsepewer,weight,acceleration,model year,name
origin,,,,,,,,
1,249,249,249,249,249,249,249,249
2,70,70,70,70,70,70,70,70
3,79,79,79,79,79,79,79,79

In [52]:
df.groupby(by=['origin']).mean() # 그룹으로 모은 뒤 각 열들의 대표값 구하기

,mpg,cylinders,displacement,weight,acceleration,model year
origin,,,,,,
1,20.083534,6.248996,245.901606,3361.931727,15.033735,75.610442
2,27.891429,4.157143,109.142857,2423.300000,16.787143,75.814286
3,30.450633,4.101266,102.708861,2221.227848,16.172152,77.443038

`-` 데이터프레임 합치기

In [6]:
# 데이터프레임 만들기 

l1 = [{'name': 'John', 'job': "teacher"},
    {'name': 'Nate', 'job': "student"},
    {'name': 'Fred', 'job': "developer"}]

l2 = [{'name': 'Ed', 'major': "mathmatics"},
    {'name': 'Nate', 'major': "computer"},
    {'name': 'Ted', 'major': "science"}]

df1 = pd.DataFrame(l1, columns = ['name', 'job'])
df2 = pd.DataFrame(l2, columns = ['name', 'major'])

print(df1)
print(df2)

   name        job
0  John    teacher
1  Nate    student
2  Fred  developer
   name       major
0    Ed  mathmatics
1  Nate    computer
2   Ted     science

In [7]:
result = df1.append(df2, ignore_index = True) # df1 끝에 df2 붙이기 (리스트 append랑 비슷하다고 보면 돼) / ignort_index = True 쓰면 인덱스 안꼬임
print(result)

   name        job       major
0  John    teacher         NaN
1  Nate    student         NaN
2  Fred  developer         NaN
3    Ed        NaN  mathmatics
4  Nate        NaN    computer
5   Ted        NaN     science

In [8]:
result = pd.concat([df1,df2], axis=1) #concat함수는 axis로 행/열 붙이기를 조절 가능 
print(result)

   name        job  name       major
0  John    teacher    Ed  mathmatics
1  Nate    student  Nate    computer
2  Fred  developer   Ted     science

In [11]:
# merge() 두 데이터프레임을 지정한 열의 각 고유값을 기준으로 병합한다. 

merge_inner = pd.merge(df1,df2) #NaN 값이 없도록 고유값들이 충족 된것만 추출
print(merge_inner, '\n')

merge_outer = pd.merge(df1,df2, how= 'outer', on = 'name') # name 열의 고유값을 기준으로 모으기! 
print(merge_outer)

   name      job     major
0  Nate  student  computer

   name        job       major
0  John    teacher         NaN
1  Nate    student    computer
2  Fred  developer         NaN
3    Ed        NaN  mathmatics
4   Ted        NaN     science